[
    {
      "id": 1,
      "title": "React",
      "description": "Learn React from beginner to advanced level, covering key concepts and advanced techniques for building dynamic web applications.",
      "duration": 40,
      "image":"https://tse3.mm.bing.net/th?id=OIP.VsvOr2Q2d_Ixr1aUDFGmIQHaHC&pid=Api&P=0&h=180",
      "languages":["English"],
      "topics": [
        {
          "name": "JSX",
          "description": "JSX allows you to write HTML-like code in JavaScript, making it easier to create React components."
        },
        {
          "name": "Components",
          "description": "Components are the building blocks of React applications, enabling reusable and maintainable code."
        },
        {
          "name": "State",
          "description": "State stores component data that can change over time, triggering re-renders to update the UI."
        },
        {
          "name": "Props",
          "description": "Props are used to pass data between components, enabling dynamic and flexible UI components."
        },
        {
          "name": "Hooks",
          "description": "Hooks like useState and useEffect allow function components to manage state and side effects."
        }
      ]
    },
    {
      "id": 2,
      "title": "SnowFlake",
      "description": "Master Snowflake data warehousing, including data loading, SQL operations, optimization, and scripting.",
      "duration": 30,
      "image":"https://tse2.mm.bing.net/th?id=OIP.sVMLFs4m2d9QGgyih-z2agHaHa&pid=Api&P=0&h=180",
      "languages":["English"],
      "topics": [
        {
          "name": "Data Loading",
          "description": "Learn how to load data efficiently into Snowflake from various sources and automate the process."
        },
        {
          "name": "SQL",
          "description": "Understand core SQL operations within Snowflake, including querying, data manipulation, and schema management."
        },
        {
          "name": "Optimization",
          "description": "Optimize Snowflake performance with query tuning, efficient data storage, and compute resource management."
        },
        {
          "name": "Scripting",
          "description": "Explore Snowflake's scripting capabilities, including stored procedures and user-defined functions."
        }
      ]
    },
    {
      "id": 3,
      "title": "Sql",
      "description": "Comprehensive SQL course for beginners, covering fundamental concepts and practical skills for database interaction.",
      "duration": 20,
      "image":"https://logodix.com/logo/541959.jpg",
      "languages":["English"],
      "topics": [
        {
          "name": "SELECT",
          "description": "Learn to write SELECT statements to query and retrieve data from databases."
        },
        {
          "name": "JOIN",
          "description": "Understand how to combine rows from multiple tables using various types of joins."
        },
        {
          "name": "WHERE",
          "description": "Use the WHERE clause to filter records based on specific conditions."
        },
        {
          "name": "GROUP BY",
          "description": "Group rows with the same values in specified columns and use aggregate functions."
        },
        {
          "name": "ORDER BY",
          "description": "Sort query results by one or more columns in ascending or descending order."
        }
      ]
    },
    {
      "id": 4,
      "title": "Python",
      "description": "Master Python programming from basics to advanced concepts, including data structures, OOP, and web development.",
      "duration": 50,
      "image":"https://logohistory.net/wp-content/uploads/2023/06/Python-Emblem.png",
      "languages": ["English"],
      "topics": [
        {
          "name": "Basics",
          "description": "Learn the fundamental syntax and basic programming constructs of Python."
        },
        {
          "name": "Data Structures",
          "description": "Understand and work with Python's built-in data structures like lists, tuples, sets, and dictionaries."
        },
        {
          "name": "OOP",
          "description": "Explore object-oriented programming concepts and how they are implemented in Python."
        },
        {
          "name": "Web Development",
          "description": "Learn to build web applications using frameworks like Django and Flask."
        },
        {
          "name": "Data Analysis",
          "description": "Perform data analysis using libraries like Pandas and NumPy."
        }
      ]
    },
    {
      "id": 5,
      "title": "Java",
      "description": "Comprehensive Java course covering fundamental concepts, advanced topics, and practical applications for building robust applications.",
      "duration": 60,
      "image":"https://logos-world.net/wp-content/uploads/2022/07/Java-Logo.png",
      "languages": ["English"],
      "topics": [
        {
          "name": "Syntax",
          "description": "Learn the basic syntax and structure of Java programming language."
        },
        {
          "name": "OOP",
          "description": "Deep dive into object-oriented programming principles and practices in Java."
        },
        {
          "name": "Data Structures",
          "description": "Understand and implement various data structures in Java."
        },
        {
          "name": "Concurrency",
          "description": "Explore concurrency and multithreading in Java for building efficient applications."
        },
        {
          "name": "Spring Framework",
          "description": "Build enterprise-level applications using the Spring framework."
        }
      ]
    },
    {
      "id": 6,
      "title": "C++",
      "description": "In-depth C++ course from basic syntax to advanced topics, including memory management, OOP, and STL.",
      "duration": 55,
      "image":"https://sdtimes.com/wp-content/uploads/2018/03/cpppp.png",
      "languages": ["English"],
      "topics": [
        {
          "name": "Basics",
          "description": "Understand the basic syntax and structure of C++ programming language."
        },
        {
          "name": "Pointers",
          "description": "Learn about pointers, memory management, and dynamic allocation."
        },
        {
          "name": "OOP",
          "description": "Explore object-oriented programming concepts and their implementation in C++."
        },
        {
          "name": "STL",
          "description": "Learn to use the Standard Template Library (STL) for efficient data handling."
        },
        {
          "name": "Templates",
          "description": "Understand templates and generic programming in C++."
        }
      ]
    }
  ]